#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary><pre><code>
module.base.data.kubectl_path_documents.kubernetes-api-ingress_manifests: Reading...
module.base.data.kubectl_path_documents.nfs-provisioner_manifests: Reading...
module.base.data.kubectl_path_documents.postgres-db_manifests: Reading...
module.base.data.kubectl_path_documents.container-registry_manifests: Reading...
module.base.data.kubectl_path_documents.cert-manager_manifests: Reading...
module.base.data.kubectl_path_documents.grafana_manifests: Reading...
module.base.data.kubectl_path_documents.home-assistant_manifests: Reading...
module.base.data.kubectl_path_documents.kubernetes-dashboard_manifests: Reading...
module.base.data.kubectl_path_documents.kubernetes-api-ingress_manifests: Read complete after 0s [id=7250339a972f14aa42654622d6d0234afeb1adb184561b590bd54a9b8f62252b]
module.base.data.kubectl_path_documents.nginx-ingress_manifests: Reading...
module.base.data.kubectl_path_documents.ntfy-server_manifests: Reading...
module.base.data.kubectl_path_documents.container-registry_manifests: Read complete after 0s [id=7ba97a1311db918cae43cc7107dc6ed0d5cc665ce4f8714abc6f0aed3352a6ac]
module.base.data.kubectl_path_documents.github-actions-user_manifests: Reading...
module.base.data.kubectl_path_documents.esphome_manifests: Reading...
module.base.data.kubectl_path_documents.nfs-provisioner_manifests: Read complete after 0s [id=f097068c63ecfc3117fd47ff06ec95f6c0afc268048600936f11c111fc3cf11b]
module.base.data.kubectl_path_documents.kubernetes-dashboard_manifests: Read complete after 0s [id=dbae520aa30c9f2dbc550a9ba6267e508c673d11dc8a1c11f11958be41683d44]
module.base.data.kubectl_path_documents.home-assistant_manifests: Read complete after 0s [id=ea86bf688ee5f29e10659c5e6d0da3727163984d194bf8a874f6e327cedc4171]
module.base.data.kubectl_path_documents.esphome_manifests: Read complete after 0s [id=613d6d238e62af12c40a9fc37059a088f0731dba002a9ae288a16fe0471cf8ce]
module.base.data.kubectl_path_documents.nginx-ingress_manifests: Read complete after 0s [id=fc40915db8535d493554c2ffab1771d225c567cdb89b4af923541b40d5d711bb]
module.base.data.kubectl_path_documents.postgres-db_manifests: Read complete after 0s [id=e2f7f03843f3c2162f5e90dfa9829653117d4cc987e4532dd52f1d8a18337857]
module.base.data.kubectl_path_documents.github-actions-user_manifests: Read complete after 0s [id=2b10eaf0017424cddc124258bab6ba69932decb83787a025f6f5a6d02f450fca]
module.base.data.kubectl_path_documents.ntfy-server_manifests: Read complete after 0s [id=fdda3db367d30c63f91e884f973807ae7744fefc5b1400f69c593dc185de29bf]
module.base.kubectl_manifest.nfs-provisioner[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/nfs-provisioner/roles/leader-locking-nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[3]: Refreshing state... [id=/apis/apps/v1/namespaces/nfs-provisioner/deployments/nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[6]: Refreshing state... [id=/api/v1/namespaces/nfs-provisioner/serviceaccounts/nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/run-nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[5]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/nfs-provisioner/rolebindings/leader-locking-nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/nfs-provisioner-runner]
module.base.kubectl_manifest.nfs-provisioner[7]: Refreshing state... [id=/apis/storage.k8s.io/v1/storageclasses/ssd]
module.base.kubectl_manifest.nfs-provisioner[0]: Refreshing state... [id=/api/v1/namespaces/nfs-provisioner]
module.base.data.kubectl_path_documents.grafana_manifests: Read complete after 0s [id=c0eb890c4368c54774ec91c677cac4cd1de7d9602abcb39a4baaa62066e67b0f]
module.base.kubectl_manifest.github-actions-user[3]: Refreshing state... [id=/api/v1/namespaces/gh-actions/secrets/gh-actions-user-secret]
module.base.data.kubectl_path_documents.cert-manager_manifests: Read complete after 0s [id=df45bd1b86f89322295c665fe5f12bacf42b9b98c73064a2879cb7b77d4476d4]
module.base.kubectl_manifest.github-actions-user[4]: Refreshing state... [id=/api/v1/namespaces/gh-actions/serviceaccounts/gh-actions-user]
module.base.kubectl_manifest.github-actions-user[0]: Refreshing state... [id=/api/v1/namespaces/gh-actions]
module.base.kubectl_manifest.github-actions-user[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/gh-actions-user]
module.base.kubectl_manifest.github-actions-user[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/gh-actions-user]
module.base.kubectl_manifest.cert-manager[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cert-manager:leaderelection]
module.base.kubectl_manifest.cert-manager[19]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-ingress-shim]
module.base.kubectl_manifest.cert-manager[14]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-issuers]
module.base.kubectl_manifest.cert-manager[5]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-orders]
module.base.kubectl_manifest.cert-manager[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/cert-manager/rolebindings/cert-manager-webhook:dynamic-serving]
module.base.kubectl_manifest.cert-manager[9]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-edit]
module.base.kubectl_manifest.cert-manager[43]: Refreshing state... [id=/api/v1/namespaces/cert-manager/services/cert-manager]
module.base.kubectl_manifest.cert-manager[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cert-manager-cainjector:leaderelection]
module.base.kubectl_manifest.cert-manager[8]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-view]
module.base.kubectl_manifest.cert-manager[29]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/orders.acme.cert-manager.io]
module.base.kubectl_manifest.cert-manager[11]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-certificatesigningrequests]
module.base.kubectl_manifest.cert-manager[30]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/mutatingwebhookconfigurations/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[17]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-orders]
module.base.kubectl_manifest.cert-manager[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-webhook:subjectaccessreviews]
module.base.kubectl_manifest.cert-manager[12]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-webhook:subjectaccessreviews]
module.base.kubectl_manifest.cert-manager[25]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/certificates.cert-manager.io]
module.base.kubectl_manifest.cert-manager[31]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[15]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-clusterissuers]
module.base.kubectl_manifest.cert-manager[0]: Refreshing state... [id=/api/v1/namespaces/cert-manager]
module.base.kubectl_manifest.cert-manager[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cert-manager:leaderelection]
module.base.kubectl_manifest.cert-manager[47]: Refreshing state... [id=/api/v1/namespaces/cert-manager/serviceaccounts/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cert-manager-cainjector:leaderelection]
module.base.kubectl_manifest.cert-manager[18]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-challenges]
module.base.kubectl_manifest.cert-manager[34]: Refreshing state... [id=/apis/apps/v1/namespaces/cert-manager/deployments/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[27]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/clusterissuers.cert-manager.io]
module.base.kubectl_manifest.cert-manager[21]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-certificatesigningrequests]
module.base.kubectl_manifest.cert-manager[45]: Refreshing state... [id=/api/v1/namespaces/cert-manager/serviceaccounts/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-certificates]
module.base.kubectl_manifest.cert-manager[20]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-approve:cert-manager-io]
module.base.kubectl_manifest.cert-manager[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/cert-manager/roles/cert-manager-webhook:dynamic-serving]
module.base.kubectl_manifest.cert-manager[6]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-challenges]
module.base.kubectl_manifest.cert-manager[10]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-approve:cert-manager-io]
module.base.kubectl_manifest.cert-manager[44]: Refreshing state... [id=/api/v1/namespaces/cert-manager/services/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[26]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/challenges.acme.cert-manager.io]
module.base.kubectl_manifest.cert-manager[28]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/issuers.cert-manager.io]
module.base.kubectl_manifest.cert-manager[16]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-certificates]
module.base.kubectl_manifest.cert-manager[36]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ca-issuer]
module.base.kubectl_manifest.cert-manager[13]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[35]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ca-issuer-stg]
module.base.kubectl_manifest.cert-manager[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-issuers]
module.base.kubectl_manifest.cert-manager[32]: Refreshing state... [id=/apis/apps/v1/namespaces/cert-manager/deployments/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[3]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-clusterissuers]
module.base.kubectl_manifest.cert-manager[24]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/certificaterequests.cert-manager.io]
module.base.kubectl_manifest.cert-manager[33]: Refreshing state... [id=/apis/apps/v1/namespaces/cert-manager/deployments/cert-manager]
module.base.kubectl_manifest.cert-manager[7]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-ingress-shim]
module.base.kubectl_manifest.cert-manager[46]: Refreshing state... [id=/api/v1/namespaces/cert-manager/serviceaccounts/cert-manager]
module.base.kubectl_manifest.cert-manager[23]: Refreshing state... [id=/api/v1/namespaces/cert-manager/configmaps/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-cainjector]
module.base.kubectl_manifest.postgres-db[0]: Refreshing state... [id=/api/v1/namespaces/postgres]
module.base.kubectl_manifest.postgres-db[5]: Refreshing state... [id=/api/v1/namespaces/postgres/services/postgres-service]
module.base.kubectl_manifest.postgres-db[4]: Refreshing state... [id=/api/v1/namespaces/postgres/secrets/postgres-secret]
module.base.kubectl_manifest.postgres-db[3]: Refreshing state... [id=/apis/apps/v1/namespaces/postgres/deployments/postgres]
module.base.kubectl_manifest.postgres-db[6]: Refreshing state... [id=/api/v1/namespaces/postgres/persistentvolumeclaims/postgres-pvc]
module.base.kubectl_manifest.postgres-db[1]: Refreshing state... [id=/api/v1/namespaces/postgres/configmaps/postgres-config]
module.base.kubectl_manifest.postgres-db[2]: Refreshing state... [id=/api/v1/namespaces/postgres/configmaps/postgres-init]
module.base.kubectl_manifest.nginx-ingress[18]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/serviceaccounts/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[8]: Refreshing state... [id=/apis/apps/v1/namespaces/ingress-nginx/deployments/ingress-nginx-controller]
module.base.kubectl_manifest.nginx-ingress[3]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[10]: Refreshing state... [id=/apis/batch/v1/namespaces/ingress-nginx/jobs/ingress-nginx-admission-patch]
module.base.kubectl_manifest.nginx-ingress[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[12]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/roles/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[17]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/serviceaccounts/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[14]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/rolebindings/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[5]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/configmaps/ingress-nginx-controller]
module.base.kubectl_manifest.nginx-ingress[7]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[15]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/services/ingress-nginx-controller]
module.base.kubectl_manifest.nginx-ingress[9]: Refreshing state... [id=/apis/batch/v1/namespaces/ingress-nginx/jobs/ingress-nginx-admission-create]
module.base.kubectl_manifest.nginx-ingress[13]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/rolebindings/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[0]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[11]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/roles/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[6]: Refreshing state... [id=/apis/networking.k8s.io/v1/ingressclasses/nginx]
module.base.kubectl_manifest.nginx-ingress[16]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/services/ingress-nginx-controller-admission]
module.base.kubectl_manifest.kubernetes-dashboard[8]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubernetes-dashboard/rolebindings/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[11]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-key-holder]
module.base.kubectl_manifest.kubernetes-dashboard[10]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-csrf]
module.base.kubectl_manifest.kubernetes-api-ingress[0]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/default/ingresses/kubeapi]
module.base.kubectl_manifest.kubernetes-dashboard[12]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/serviceaccounts/kubernetes-dashboard]
module.base.kubectl_manifest.home-assistant[3]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/homeassistant/ingresses/homeassistant-ingress]
module.base.kubectl_manifest.kubernetes-dashboard[6]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/kubernetes-dashboard/ingresses/kubernetes-ingress]
module.base.kubectl_manifest.kubernetes-dashboard[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[3]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/configmaps/kubernetes-dashboard-settings]
module.base.kubectl_manifest.kubernetes-dashboard[5]: Refreshing state... [id=/apis/apps/v1/namespaces/kubernetes-dashboard/deployments/dashboard-metrics-scraper]
module.base.kubectl_manifest.kubernetes-dashboard[0]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[7]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubernetes-dashboard/roles/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[14]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/services/dashboard-metrics-scraper]
module.base.kubectl_manifest.kubernetes-dashboard[9]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-certs]
module.base.kubectl_manifest.kubernetes-dashboard[13]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/services/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[4]: Refreshing state... [id=/apis/apps/v1/namespaces/kubernetes-dashboard/deployments/kubernetes-dashboard]
module.base.kubectl_manifest.home-assistant[4]: Refreshing state... [id=/api/v1/namespaces/homeassistant/services/homeassistant]
module.base.kubectl_manifest.home-assistant[5]: Refreshing state... [id=/api/v1/namespaces/homeassistant/persistentvolumeclaims/ha-pvc]
module.base.kubectl_manifest.home-assistant[0]: Refreshing state... [id=/api/v1/namespaces/homeassistant]
module.base.kubectl_manifest.home-assistant[1]: Refreshing state... [id=/api/v1/namespaces/homeassistant/configmaps/homeassistant-config]
module.base.kubectl_manifest.home-assistant[2]: Refreshing state... [id=/apis/apps/v1/namespaces/homeassistant/deployments/homeassistant]
module.base.kubectl_manifest.container-registry[3]: Refreshing state... [id=/api/v1/namespaces/registry/services/registry-service]
module.base.kubectl_manifest.grafana[0]: Refreshing state... [id=/apis/apps/v1/namespaces/postgres/deployments/grafana]
module.base.kubectl_manifest.grafana[2]: Refreshing state... [id=/api/v1/namespaces/postgres/services/grafana]
module.base.kubectl_manifest.grafana[1]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/postgres/ingresses/grafana-ingress]
module.base.kubectl_manifest.container-registry[4]: Refreshing state... [id=/api/v1/namespaces/registry/persistentvolumeclaims/registry-pvc]
module.base.kubectl_manifest.grafana[3]: Refreshing state... [id=/api/v1/namespaces/postgres/persistentvolumeclaims/grafana-pvc]
module.base.kubectl_manifest.container-registry[0]: Refreshing state... [id=/api/v1/namespaces/registry]
module.base.kubectl_manifest.container-registry[1]: Refreshing state... [id=/apis/apps/v1/namespaces/registry/deployments/registry]
module.base.kubectl_manifest.container-registry[2]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/registry/ingresses/registry-ingress]
module.base.kubectl_manifest.esphome[0]: Refreshing state... [id=/apis/apps/v1/namespaces/homeassistant/deployments/esphome]
module.base.kubectl_manifest.esphome[2]: Refreshing state... [id=/api/v1/namespaces/homeassistant/services/esphome]
module.base.kubectl_manifest.esphome[1]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/homeassistant/ingresses/esphome-ingress]
module.base.kubectl_manifest.esphome[3]: Refreshing state... [id=/api/v1/namespaces/homeassistant/persistentvolumeclaims/esphome-pvc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.base.kubectl_manifest.container-registry[1] will be updated in-place
  ~ resource "kubectl_manifest" "container-registry" {
        id                      = "/apis/apps/v1/namespaces/registry/deployments/registry"
        name                    = "registry"
      ~ uid                     = "3805f666-cd00-49f0-baf4-d4cf96994c34" -> (known after apply)
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: registry
              namespace: registry
            spec:
              replicas: 1
              selector:
                matchLabels:
                  app: registry
              template:
                metadata:
                  labels:
                    app: registry
                spec:
                  containers:
          -       - env:
          -         - name: REGISTRY_HTTP_TLS_CERTIFICATE
          -           value: /certs/tls.crt
          -         - name: REGISTRY_HTTP_TLS_KEY
          -           value: /certs/tls.key
          -         image: registry:latest
          +       - image: registry:latest
                    name: registry
                    ports:
                    - containerPort: 5000
                    volumeMounts:
                    - mountPath: /var/lib/registry
                      name: registry-pv
                      subPath: registry
          -         - mountPath: /certs
          -           name: certs
          +       nodeSelector:
          +         kubernetes.io/arch: amd64
          +         kubernetes.io/hostname: hp-elitedesk
                  volumes:
                  - name: registry-pv
                    persistentVolumeClaim:
                      claimName: registry-pvc
          -       - name: certs
          -         secret:
          -           secretName: registry-certs
        EOT
        # (12 unchanged attributes hidden)
    }

  # module.base.kubectl_manifest.container-registry[2] will be created
  + resource "kubectl_manifest" "container-registry" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "registry-service"
      + namespace               = "registry"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                app: registry
              name: registry-service
              namespace: registry
            spec:
              ports:
              - name: registry
                nodePort: 30500
                port: 5000
                targetPort: 5000
              selector:
                app: registry
              type: NodePort
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.container-registry[3] must be replaced
-/+ resource "kubectl_manifest" "container-registry" {
      ~ id                      = "/api/v1/namespaces/registry/services/registry-service" -> (known after apply)
      ~ kind                    = "Service" -> "PersistentVolumeClaim" # forces replacement
      ~ live_manifest_incluster = (sensitive value)
      ~ live_uid                = "f28c0a76-aa6e-47a3-9ab0-60677bb1cd57" -> (known after apply)
      ~ name                    = "registry-service" -> "registry-pvc" # forces replacement
      ~ uid                     = "0d8803c6-32ea-4032-98cc-4e031eb23279" -> (known after apply)
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: v1
          - kind: Service
          + kind: PersistentVolumeClaim
            metadata:
          -   labels:
          -     app: registry
          -   name: registry-service
          +   name: registry-pvc
              namespace: registry
            spec:
          -   ports:
          -   - name: registry
          -     port: 5000
          -     targetPort: 5000
          -   selector:
          -     app: registry
          +   accessModes:
          +   - ReadWriteOnce
          +   resources:
          +     requests:
          +       storage: 5Gi
          +   storageClassName: ssd
        EOT
      ~ yaml_incluster          = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.base.kubectl_manifest.container-registry[4] will be destroyed
  # (because index [4] is out of range for count)
  - resource "kubectl_manifest" "container-registry" {
      - api_version             = "v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/api/v1/namespaces/registry/persistentvolumeclaims/registry-pvc" -> null
      - kind                    = "PersistentVolumeClaim" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "423d8a0e-ed21-4ee8-a5bd-526eecc73076" -> null
      - name                    = "registry-pvc" -> null
      - namespace               = "registry" -> null
      - server_side_apply       = false -> null
      - uid                     = "6cf9d8d9-0be1-47af-947f-4323dd3aefe8" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              labels:
                type: local
              name: registry-pvc
              namespace: registry
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 5Gi
              storageClassName: ssd
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # module.base.kubectl_manifest.kubernetes-dashboard[10] will be updated in-place
  ~ resource "kubectl_manifest" "kubernetes-dashboard" {
        id                      = "/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-csrf"
        name                    = "kubernetes-dashboard-csrf"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # module.base.kubectl_manifest.ntfy-server[0] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: ntfy
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[1] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-config"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              server.yml: |-
                base-url: "https://ntfy.spof.tech"
                listen-http: ":80"
                listen-https: ":443"
                key-file: "/etc/letsencrypt/live/tls.key"
                cert-file: "/etc/letsencrypt/live/tls.crt"
                cache-file: "/var/cache/ntfy/cache.db"
                cache-duration: "24h"
                attachment-cache-dir: "/var/cache/ntfy/attachments"
                attachment-file-size-limit: "1M"
                attachment-expiry-duration: "24h"
                auth-file: "/var/lib/ntfy/user.db"
                auth-default-access: "read-only"
                web-root: "/"
                global-topic-limit: 150
                visitor-subscription-limit: 30
                visitor-request-limit-burst: 60
                visitor-request-limit-replenish: "1m"
                behind-proxy: true
                upstream-base-url: "https://ntfy.sh"
            kind: ConfigMap
            metadata:
              name: ntfy-config
              namespace: ntfy
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[2] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app: ntfy
              name: ntfy
              namespace: ntfy
            spec:
              replicas: 1
              selector:
                matchLabels:
                  app: ntfy
              template:
                metadata:
                  labels:
                    app: ntfy
                spec:
                  containers:
                  - args:
                    - serve
                    image: binwiederhier/ntfy:latest
                    name: ntfy
                    ports:
                    - containerPort: 80
                      name: http
                    - containerPort: 443
                      name: https
                    resources:
                      limits:
                        cpu: 500m
                        memory: 128Mi
                    volumeMounts:
                    - mountPath: /etc/ntfy/server.yml
                      name: config
                      readOnly: true
                      subPath: server.yml
                    - mountPath: /var/cache/ntfy
                      name: cache
                    - mountPath: /var/lib/ntfy
                      name: user-db
                    - mountPath: /etc/letsencrypt/live/
                      name: certs
                  volumes:
                  - configMap:
                      name: ntfy-config
                    name: config
                  - name: cache
                    persistentVolumeClaim:
                      claimName: ntfy-cache
                  - name: user-db
                    persistentVolumeClaim:
                      claimName: ntfy-user-db
                  - name: certs
                    secret:
                      secretName: ntfy-certs
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[3] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Ingress"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-ingress"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                cert-manager.io/cluster-issuer: ca-issuer
                nginx.ingress.kubernetes.io/auth-tls-pass-certificate-to-upstream: "true"
                nginx.ingress.kubernetes.io/backend-protocol: HTTPS
              name: ntfy-ingress
              namespace: ntfy
            spec:
              ingressClassName: nginx
              rules:
              - host: ntfy.spof.tech
                http:
                  paths:
                  - backend:
                      service:
                        name: ntfy-tls
                        port:
                          name: https
                    path: /
                    pathType: Prefix
              tls:
              - hosts:
                - ntfy.spof.tech
                secretName: ntfy-certs
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[4] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-tls"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              name: ntfy-tls
              namespace: ntfy
            spec:
              ports:
              - name: http
                port: 80
                targetPort: 80
              - name: https
                port: 443
                targetPort: 443
              selector:
                app: ntfy
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[5] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PersistentVolumeClaim"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-cache"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: ntfy-cache
              namespace: ntfy
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 500Mi
              storageClassName: ssd
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[6] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PersistentVolumeClaim"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-user-db"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: ntfy-user-db
              namespace: ntfy
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 100Mi
              storageClassName: ssd
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 9 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

</code></pre></details>

*Pushed by: @marcleibold, Action: `pull_request`*
<!-- Sticky Pull Request Comment -->